In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import scipy as sp
import seaborn as sns
import os,sys
import warnings 
warnings.filterwarnings('ignore')

In [2]:
os.listdir()

['.ipynb_checkpoints',
 'data_information.txt',
 'google-maps-services-python-master',
 'google-maps-services-python-master.zip',
 'preprocess data.ipynb',
 'sample_submission.csv',
 'test_questions.csv',
 'train_revised.csv',
 'train_revised_11.09.2018.zip']

In [3]:
train_revised = pd.read_csv('train_revised.csv')
test_questions = pd.read_csv('test_questions.csv')

In [4]:
train_revised.head(2)

,ride_id,seat_number,payment_method,payment_receipt,travel_date,travel_time,travel_from,travel_to,car_type,max_capacity
0,1442,15A,Mpesa,UZUEHCBUSO,17-10-17,7:15,Migori,Nairobi,Bus,49
1,5437,14A,Mpesa,TIHLBUSGTE,19-11-17,7:12,Migori,Nairobi,Bus,49

In [5]:
train_revised.columns

Index(['ride_id', 'seat_number', 'payment_method', 'payment_receipt',
       'travel_date', 'travel_time', 'travel_from', 'travel_to', 'car_type',
       'max_capacity'],
      dtype='object')

In [6]:
train_revised.keys()

Index(['ride_id', 'seat_number', 'payment_method', 'payment_receipt',
       'travel_date', 'travel_time', 'travel_from', 'travel_to', 'car_type',
       'max_capacity'],
      dtype='object')

In [7]:
train_revised.describe()

            ride_id  max_capacity
count  51645.000000  51645.000000
mean   10188.645793     34.534321
std     2211.295708     18.451193
min     1442.000000     11.000000
25%     8287.000000     11.000000
50%    10353.000000     49.000000
75%    12029.000000     49.000000
max    20117.000000     49.000000

In [8]:
train_revised.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51645 entries, 0 to 51644
Data columns (total 10 columns):
ride_id            51645 non-null int64
seat_number        51645 non-null object
payment_method     51645 non-null object
payment_receipt    51645 non-null object
travel_date        51645 non-null object
travel_time        51645 non-null object
travel_from        51645 non-null object
travel_to          51645 non-null object
car_type           51645 non-null object
max_capacity       51645 non-null int64
dtypes: int64(2), object(8)
memory usage: 3.9+ MB

In [9]:
# number of unique id's
np.unique(train_revised['ride_id']).shape # this implies there are some id's that are repeated

(6249,)

In [10]:
# number of unique seat number
np.unique(train_revised['seat_number']).shape #61 numbers of unique seats

(61,)

In [11]:
# number of unique payment methods
np.unique(train_revised['payment_method']).shape

(2,)

In [12]:
# number of payment_receipt
np.unique(train_revised['payment_receipt']).shape

(51645,)

In [13]:
# travel_date, travel_time = calculate in months
#travel_from, travel_to = calculate the distance of travel

In [14]:
# car type correlate with distance of travel
np.unique(train_revised['car_type'])

array(['Bus', 'shuttle'], dtype=object)

In [15]:
# max_capacity
np.unique(train_revised['max_capacity'])

array([11, 49], dtype=int64)

In [16]:
train_revised.head()

,ride_id,seat_number,payment_method,payment_receipt,travel_date,travel_time,travel_from,travel_to,car_type,max_capacity
0,1442,15A,Mpesa,UZUEHCBUSO,17-10-17,7:15,Migori,Nairobi,Bus,49
1,5437,14A,Mpesa,TIHLBUSGTE,19-11-17,7:12,Migori,Nairobi,Bus,49
2,5710,8B,Mpesa,EQX8Q5G19O,26-11-17,7:05,Keroka,Nairobi,Bus,49
3,5777,19A,Mpesa,SGP18CL0ME,27-11-17,7:10,Homa Bay,Nairobi,Bus,49
4,5778,11A,Mpesa,BM97HFRGL9,27-11-17,7:12,Migori,Nairobi,Bus,49

In [17]:
# travel time

def update_travel_time(data):
    updated_time_in_seconds = 0
    updated_time_list_in_seconds = []
    for kk in data['travel_time']:
        splitted_kk = kk.split(':')
        updated_time_in_seconds = int(splitted_kk[0]) * 60 + int(splitted_kk[1])
        updated_time_list_in_seconds.append(updated_time_in_seconds)
    return np.array(updated_time_list_in_seconds)

train_revised['travel_time_in_seconds'] = update_travel_time(train_revised)

In [18]:
string = '4:54'
string.split(':')

['4', '54']

In [19]:
np.unique(train_revised['travel_from'])

array(['Awendo', 'Homa Bay', 'Kehancha', 'Kendu Bay', 'Keroka', 'Keumbu',
       'Kijauri', 'Kisii', 'Mbita', 'Migori', 'Ndhiwa', 'Nyachenge',
       'Oyugis', 'Rodi', 'Rongo', 'Sirare', 'Sori'], dtype=object)

In [20]:
np.unique(train_revised['travel_to'])

array(['Nairobi'], dtype=object)

In [21]:
train_revised.head()

,ride_id,seat_number,payment_method,payment_receipt,travel_date,travel_time,travel_from,travel_to,car_type,max_capacity,travel_time_in_seconds
0,1442,15A,Mpesa,UZUEHCBUSO,17-10-17,7:15,Migori,Nairobi,Bus,49,435
1,5437,14A,Mpesa,TIHLBUSGTE,19-11-17,7:12,Migori,Nairobi,Bus,49,432
2,5710,8B,Mpesa,EQX8Q5G19O,26-11-17,7:05,Keroka,Nairobi,Bus,49,425
3,5777,19A,Mpesa,SGP18CL0ME,27-11-17,7:10,Homa Bay,Nairobi,Bus,49,430
4,5778,11A,Mpesa,BM97HFRGL9,27-11-17,7:12,Migori,Nairobi,Bus,49,432

In [22]:
updated_train = train_revised.drop('travel_time', axis = 1)

In [23]:
updated_train.head()

,ride_id,seat_number,payment_method,payment_receipt,travel_date,travel_from,travel_to,car_type,max_capacity,travel_time_in_seconds
0,1442,15A,Mpesa,UZUEHCBUSO,17-10-17,Migori,Nairobi,Bus,49,435
1,5437,14A,Mpesa,TIHLBUSGTE,19-11-17,Migori,Nairobi,Bus,49,432
2,5710,8B,Mpesa,EQX8Q5G19O,26-11-17,Keroka,Nairobi,Bus,49,425
3,5777,19A,Mpesa,SGP18CL0ME,27-11-17,Homa Bay,Nairobi,Bus,49,430
4,5778,11A,Mpesa,BM97HFRGL9,27-11-17,Migori,Nairobi,Bus,49,432

In [24]:
#dicted_train_car_type = dict(updated_train['car_type'].value_counts())

#plt.bar(dicted_train_car_type.keys(), dicted_train_car_type.values())
#plt.show()

In [25]:
np.unique(updated_train['car_type'])

array(['Bus', 'shuttle'], dtype=object)

In [26]:
car_type_data = pd.get_dummies(updated_train, columns =['car_type'])
            
car_type_data.head()

,ride_id,seat_number,payment_method,payment_receipt,travel_date,travel_from,travel_to,max_capacity,travel_time_in_seconds,car_type_Bus,car_type_shuttle
0,1442,15A,Mpesa,UZUEHCBUSO,17-10-17,Migori,Nairobi,49,435,1,0
1,5437,14A,Mpesa,TIHLBUSGTE,19-11-17,Migori,Nairobi,49,432,1,0
2,5710,8B,Mpesa,EQX8Q5G19O,26-11-17,Keroka,Nairobi,49,425,1,0
3,5777,19A,Mpesa,SGP18CL0ME,27-11-17,Homa Bay,Nairobi,49,430,1,0
4,5778,11A,Mpesa,BM97HFRGL9,27-11-17,Migori,Nairobi,49,432,1,0

In [27]:
drop_payment_data = car_type_data.drop('payment_receipt', axis = 1)
drop_payment_data.head()

,ride_id,seat_number,payment_method,travel_date,travel_from,travel_to,max_capacity,travel_time_in_seconds,car_type_Bus,car_type_shuttle
0,1442,15A,Mpesa,17-10-17,Migori,Nairobi,49,435,1,0
1,5437,14A,Mpesa,19-11-17,Migori,Nairobi,49,432,1,0
2,5710,8B,Mpesa,26-11-17,Keroka,Nairobi,49,425,1,0
3,5777,19A,Mpesa,27-11-17,Homa Bay,Nairobi,49,430,1,0
4,5778,11A,Mpesa,27-11-17,Migori,Nairobi,49,432,1,0

In [28]:
update_payment_data = pd.get_dummies(drop_payment_data, columns = ['payment_method'])
update_payment_data.head()

,ride_id,seat_number,travel_date,travel_from,travel_to,max_capacity,travel_time_in_seconds,car_type_Bus,car_type_shuttle,payment_method_Cash,payment_method_Mpesa
0,1442,15A,17-10-17,Migori,Nairobi,49,435,1,0,0,1
1,5437,14A,19-11-17,Migori,Nairobi,49,432,1,0,0,1
2,5710,8B,26-11-17,Keroka,Nairobi,49,425,1,0,0,1
3,5777,19A,27-11-17,Homa Bay,Nairobi,49,430,1,0,0,1
4,5778,11A,27-11-17,Migori,Nairobi,49,432,1,0,0,1

In [29]:
# come up with a new dataframe containing all unique id's and then associated information like mean of the distances, 
# mean of the time interval
def get_days(start_month, number_of_months):
    month_year = {1:31,2:28,3:31,4:30,5:31,6:30,7:31,8:31,9:30,10:31,11:30,12:31}
    compute_1 = 0
    if number_of_months < 12:
        for i in range(start_month, start_month + number_of_months):
            if i > 12:
                j = i - 12
                compute_1 += month_year[j]
            else:
                compute_1 += month_year[i]
            
    elif number_of_months == 12:
        compute_1 = 365
        
    elif number_of_months > 12 and number_of_months < 24:
        compute_1 = 365
        difference = number_of_month - 12
        for i in range(start_month,start_month + difference):
            if i > 12:
                j = i - 12
                compute_1 += month_year[j]
            else:
                comput_1 += month_year[i]
        
    else:
        compute_1 = 365 *2
    return compute_1



def calculate_time_frame(data):
    data_column = data['travel_date']
    month_year = {1:31,2:28,3:31,4:30,5:31,6:30,7:31,8:31,9:30,10:31,11:30,12:31}
    output_list = []
    for dat in data_column:
        splitted_data = dat.split('-')
        date, month, year = int(splitted_data[0]), int(splitted_data[1]), int(splitted_data[2])
        current_date, current_month, current_year = 22,10,18
        if (current_year - year) == 1:
            compute_months_till_now = 12 - month + current_month
            number_of_days = get_days(month, compute_months_till_now)
            output_list.append(number_of_days)
        else:
            output_list.append(100)
    return np.array(output_list)


update_payment_data['new_time_frame'] = calculate_time_frame(update_payment_data)

In [30]:
drop_travel_date_data = update_payment_data.drop('travel_date', axis = 1)
drop_travel_date_data.head()

,ride_id,seat_number,travel_from,travel_to,max_capacity,travel_time_in_seconds,car_type_Bus,car_type_shuttle,payment_method_Cash,payment_method_Mpesa,new_time_frame
0,1442,15A,Migori,Nairobi,49,435,1,0,0,1,365
1,5437,14A,Migori,Nairobi,49,432,1,0,0,1,334
2,5710,8B,Keroka,Nairobi,49,425,1,0,0,1,334
3,5777,19A,Homa Bay,Nairobi,49,430,1,0,0,1,334
4,5778,11A,Migori,Nairobi,49,432,1,0,0,1,334

# using google maps API to calculate the distances from column (travel_from) to column(travel_to) to have a new column called 'distance'

In [31]:
from_location = drop_travel_date_data['travel_from'].unique()

In [ ]:
import urllib.request
import json
'https://maps.googleapis.com/maps/api/distancematrix/json?origins=Seattle&destinations=San+Francisco&key=YOUR_API_KEY'

size_locations = len(from_location)
to_location = np.unique(drop_travel_date_data['travel_to']) * size_location
key = 'AIzaSyCLNO5mol_LjqDuOkTKLBke4Q9de-6GVy4'


def get_me_distance_map(from_location, to_location, key):
    for i, j in zip(from_location, to_location):
        endpoint = 'https://maps.googleapis.com/maps/api/distancematrix/json?'
        api_key = key
        origin, destination = i.replace(' ', '+'), j.replace(' ', '+')
        nav_request = 'origin=()&destination=()&key=()'.format(origin, destination, api_key) 
        
        request = endpoint + nav_request
        response = urllib.request.urlopen(request).read()
        d

In [ ]:
import urllib.request
import json
endpoint = 'https://maps.googleapis.com/maps/api/distancematrix/json?'
api_key = 'AIzaSyCLNO5mol_LjqDuOkTKLBke4Q9de-6GVy4'
origin = input("Where are you?: ").replace(' ','+')
destination = input("Where do you want to go?: ").replace(' ', '+')

nav_request = 'origin=()&destination=()&key=()'.format(origin, destination, api_key)


request = endpoint + nav_request
response = urllib.request.urlopen(request).read()

directions = json.loads(response)
print(directions)